SET NAMES UTF8;
DROP DATABASE IF EXISTS am;
CREATE DATABASE am CHARSET=UTF8;
USE am;

#建立login表
CREATE TABLE am_login(
  id INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(50),
  upwd VARCHAR(32)
);
#测试数据
INSERT INTO am_login VALUES(null,'a@a.a',md5('123456'));
INSERT INTO am_login VALUES(null,'tom@tom.tom',md5('123456'));
INSERT INTO am_login VALUES(null,'1',md5('1'));

#建立家族列表
CREATE TABLE am_family(
  fid INT PRIMARY KEY AUTO_INCREMENT,
  fname VARCHAR(32)                      #家族名称
);

#建立商品表
CREATE TABLE am_gas(
  gid INT PRIMARY KEY AUTO_INCREMENT,
  family_id INT,
  title VARCHAR(128),                    #主标题
  subtitle VARCHAR(128),                 #副标题
  price DECIMAL(10,2),                   #价格
  category VARCHAR(32),                  #所属分类
  details VARCHAR(1024),                 #产品详细说明
  sold_count INT,                        #已售出数量
  img_url VARCHAR(128)                       #图片路径 
);

/*********导入数据**********************************************************/

/**气体家族**/
INSERT INTO am_family VALUES
(NULL,"氧气"),
(NULL,"古空气"),
(NULL,"其他气体"),
(NULL,"毒气");

/**气体表**/
INSERT INTO am_gas VALUES
(NULL,1,"普通氧气","最一般的氧气满足日常需求",100,"氧气","最普通的氧气,无添加营养成分,仅满足日常生理需求.便宜且深受公民喜爱.",0,"img/10.jpg"),
(NULL,1,"中级氧气","满足日常需求,同时加强吸入时的享受",300,"氧气","中级氧气,无添加营养成分,加强吸入体验.是很好的廉价上瘾气体.",0,"img/24.jpg"),
(NULL,1,"高级氧气","不仅满足需求,还把吸气带入高级体验",800,"氧气","高级氧气,无添加营养成分,有钱人的氧气选择.高等公民用气.",0,"img/20.jpg"),
(NULL,1,"特级氧气","美妙的体验,必须试一次",1000,"氧气","中级氧气,无添加营养成分,加强吸入体验.是很好的廉价上瘾气体.",0,"img/20.jpg"),
(NULL,1,"特级氧气","美妙的体验,必须试一次,就停不下来",2000,"氧气","中级氧气,无添加营养成分,加强吸入体验.是很好的廉价上瘾气体.",0,"img/14.jpg"),
(NULL,1,"预约级氧气","根据你的需要特殊调配",550,"氧气","根据你的需求,特别调配的氧气,出货量少.",0,"img/14.jpg"),
(NULL,1,"预约级氧气","根据你的需要特殊调配",698,"氧气","根据你的需求,特别调配的氧气,出货量少.",0,"img/14.jpg"),
(NULL,1,"专属级氧气","对你专属供应",311,"氧气","对个人专属调配的空气,每轮定期供应",0,"img/24.jpg"),
(NULL,1,"专属级氧气","对你专属供应",333,"氧气","中级氧气,无添加营养成分,加强吸入体验.是很好的廉价上瘾气体.",0,"img/14.jpg"),
(NULL,1,"神秘氧气","你猜不到是什么,你也不想猜",1000,"古空气","神秘的你都不敢买",0,"img/20.jpg"),
(NULL,2,"2019年普空气","2019年某地的空气",1000,"古空气","古董空气,尝试古老的味道,由我们的员工从2019年带回来的.",0,"img/1.jpg"),
(NULL,2,"2000年普空气","2000年某地的空气",6000,"古空气","古董空气,尝试古老的味道,由我们的员工从2000年带回来的.",0,"img/2.jpg"),
(NULL,2,"1957年普空气","1957年某地的空气",2000,"古空气","古董空气,尝试古老的味道,由我们的员工从1957年带回来的.",0,"img/3.jpg"),
(NULL,2,"1949年开国空气","开国大典天安门上的空气",7000,"古空气","享受和毛主席呼吸同样空气的感觉",0,"img/4.jpg"),
(NULL,2,"1987年普空气","某处大古空气",10000,"古空气","和饥荒的人民呼吸同样的空气,感受当时他们的焦虑",0,"img/2.jpg"),
(NULL,2,"1300年古空气","你从来没试过的的远古带空气",20000,"古空气","远古空气,感受1000多年前人民所呼吸的气味",0,"img/1.jpg"),
(NULL,2,"1500年古空气","你从来没试过的的远古带空气",20000,"古空气","远古空气,感受1000多年前人民所呼吸的气味",0,"img/3.jpg"),
(NULL,2,"1480年古空气","你从来没试过的的远古带空气",20000,"古空气","远古空气,感受1000多年前人民所呼吸的气味",0,"img/2.jpg"),
(NULL,2,"1260年古空气","你从来没试过的的远古带空气",20000,"古空气","远古空气,感受1000多年前人民所呼吸的气味",0,"img/4.jpg"),
(NULL,2,"1160年古空气","你从来没试过的的远古带空气",20000,"古空气","远古空气,感受1000多年前人民所呼吸的气味",0,"img/3.jpg"),
(NULL,2,"500年远古空气","你从来没试过的的远古带空气",50000,"古空气","地球尚未有人类踏足,那时的空气会是怎么样的呢",0,"img/1.jpg"),
(NULL,2,"300年远古空气","你从来没试过的的远古带空气",50000,"古空气","地球尚未有人类踏足,那时的空气会是怎么样的呢",0,"img/2.jpg"),
(NULL,2,"800年远古空气","你从来没试过的的远古带空气",50000,"古空气","地球尚未有人类踏足,那时的空气会是怎么样的呢",0,"img/3.jpg"),
(NULL,2,"300年远古空气","你从来没试过的的远古带空气",50000,"古空气","地球尚未有人类踏足,那时的空气会是怎么样的呢",0,"img/4.jpg"),
(NULL,2,"地球初始空气","尝试地球初成时的空气",50000,"古空气","你不会知道当地球初成时是什么样子",0,"img/1.jpg"),
(NULL,2,"地球初始空气","尝试地球初成时的空气",50000,"古空气","你不会知道当地球初成时是什么样子",0,"img/4.jpg"),
(NULL,2,"地球初始空气","尝试地球初成时的空气",50000,"古空气","你不会知道当地球初成时是什么样子",0,"img/1.jpg"),